# ElectricalDemandFactorDefinition Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalDemandFactorDefinition Constructor
ElectricalDemandFactorDefinition Class See Also
---
Constructs a new ElectricalDemandFactorDefinition with default settings.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElectricalDemandFactorDefinition()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ElectricalDemandFactorDefinition()
```

# See Also
ElectricalDemandFactorDefinition Class
Autodesk.Revit.DB.Electrical Namespace